nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/driver_examples/eqdc/basic/cm33_core1/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitI2C6Pins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A5, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AON_09, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: B1, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AON_08, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: High,
    slew_rate: Slow}
  - {pin_num: P17, peripheral: XBAR1, signal: 'IN, 18', pin_signal: GPIO_AD_12, software_input_on: Enable}
  - {pin_num: B16, peripheral: XBAR1, signal: 'IN, 20', pin_signal: GPIO_SD_B1_00, software_input_on: Enable}
  - {pin_num: D14, peripheral: XBAR1, signal: 'IN, 22', pin_signal: GPIO_SD_B1_02, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
    BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL2 = ((BLK_CTRL_WAKEUPMIX->XBAR_DIR_CTRL2 &
      (~(BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_45_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_46_MASK | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_48_MASK))) /* Mask bits to zero which are setting */
        | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_45(0x00U) /* IOMUXC XBAR_INOUT45 function direction select: XBAR_INOUT as input */
        | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_46(0x00U) /* IOMUXC XBAR_INOUT46 function direction select: XBAR_INOUT as input */
        | BLK_CTRL_WAKEUPMIX_XBAR_DIR_CTRL2_IOMUXC_XBAR_DIR_SEL_48(0x00U) /* IOMUXC XBAR_INOUT48 function direction select: XBAR_INOUT as input */
    );

    IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD0__XBAR1_XBAR_INOUT45, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD1__XBAR1_XBAR_INOUT46, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH3_RXD3__XBAR1_XBAR_INOUT48, 1U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
